CREATE PROC InfStrah
(
@fam nvarchar(20),
@imya nvarchar(10),
@otchestvo nvarchar(15)
)
AS
SELECT Владелец.ID_Клиента, Автомобиль.Гос_Знак, Автомобиль.Регион, Автомобиль.МаркаАвто, Автомобиль.Модель,
Страховка.Начало_Страховки, Страховка.Окончание_Страховки, Страховка.ОСАГО, Страховка.КАСКО
FROM Владелец INNER JOIN Клиент ON Владелец.ID_Клиента = Клиент.ID_Клиента INNER JOIN Автомобиль ON Клиент.ID_Клиента = Автомобиль.Клиент
INNER JOIN Страховка ON Автомобиль.ID_Автомобиля = Страховка.Автомобиль
 WHERE Клиент.Фамилия LIKE '%' + @fam + '%' AND Клиент.Имя LIKE '%' + @imya + '%' AND Клиент.Отчество LIKE '%' + @otchestvo + '%'

 go

 exec InfStrah @fam = 'Ганишин', @imya = 'Олег', @otchestvo = 'Михайлович'