create proc PoiskAvtoInFIO
(
@fam nvarchar(20),
@imya nvarchar(10),
@otchestvo nvarchar(15)
)
as
SELECT Владелец.ID_Клиента, Клиент.Фамилия, Клиент.Имя, Клиент.Отчество, Клиент.Номер_Телефона AS [Номер телефона], Клиент.ДатаРождения AS [Дата рождения], Клиент.ГородПроживания AS [Город проживания],
Клиент.Улица, Клиент.НомерДома AS [Номер дома], Автомобиль.МаркаАвто as [Марка автомобиля], Автомобиль.Модель, Автомобиль.ГодПроизводства AS [Год производства], Автомобиль.Цвет, 
Автомобиль.НомерVIN as [VIN], Автомобиль.НомерДвигателя as [Номер двигателя]  
--ВодительскоеУдостоверение.ID_ВодительскогоУдостоверения as [Номер ВУ], Штрафы.Протокол AS [Номер протокола]

 FROM Владелец inner join Клиент on Владелец.ID_Клиента = Клиент.ID_Клиента inner join Автомобиль on Клиент.ID_Клиента = Автомобиль.Клиент
 WHERE Клиент.Фамилия LIKE '%' + @fam + '%' AND Клиент.Имя LIKE '%' + @imya + '%' AND Клиент.Отчество LIKE '%' + @otchestvo + '%'

go

 exec PoiskAvtoInFIO @fam = 'Ганишин', @imya = 'Олег', @otchestvo = 'Михайлович'