create proc vivodUgon
(
@marca varchar(30),
@model varchar(30)
)
as
SELECT Автомобиль.ID_Автомобиля AS [Код автомобиля], Клиент.Фамилия, Клиент.Имя, Клиент.Отчество, Клиент.Номер_Телефона AS [Номер телефона],
 Автомобиль.НомерДвигателя AS [Номер двигателя], Автомобиль.НомерVIN AS [Номер VIN], 
 Автомобиль.Гос_Знак AS [Номерной знак], Автомобиль.Регион, Автомобиль.МаркаАвто AS [Марка автомобиля], Автомобиль.Модель, Автомобиль.Цвет
 FROM Автомобиль inner join Клиент on Автомобиль.Клиент = Клиент.ID_Клиента
 WHERE Автомобиль.В_угоне = 0 and Автомобиль.МаркаАвто LIKE '%' + @marca + '%' AND Автомобиль.Модель LIKE '%' + @model + '%'

go

 exec vivodUgon @marca = 'Хонда', @model = 'CRV'

